app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "first comment"], ["commenter", "Artem"], ["created_at", Sun, 29 Dec 2013 09:39:51 UTC +00:00], ["post_id", 3], ["updated_at", Sun, 29 Dec 2013 09:39:51 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)