app/controllers/posts_controller.rb

	def create
	  @post = Post.new(post_params)
	  if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 04 Jan 2014 12:15:47 UTC +00:00], ["text", "sadasdassdasd"], ["title", "wqdqwd"], ["updated_at", Sat, 04 Jan 2014 12:15:47 UTC +00:00], ["user_id", 12]]