app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)
	  if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 04 Jan 2014 07:22:58 UTC +00:00], ["email", "jake@bk.ru"], ["name", "Artem"], ["password", "qwerty"], ["updated_at", Sat, 04 Jan 2014 07:22:58 UTC +00:00]]

  def session_create
	  @user = User.find_by_name(params[:user][:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'Artem' LIMIT 1